{
  "fullname": "Drake Costa",

  "headline": "Front-End JavaScript Engineer",

  "contact": {
    "email": "drake@saeris.io",
    "phone": "(925) 548-2801",
    "links": [
      { "title": "LinkedIn", "icon": "linkedin-square", "url": "http://www.linkedin.com/in/saeris" },
      { "title": "GitHub", "icon": "github", "url": "http://www.github.com/Saeris" }
    ]
  },

  "skills": [
    { "name": "HTML5 */* CSS3 */* Sass", "rating": 5, "years": 17 },
    { "name": "JavaScript */* jQuery */* ES6", "rating": 4, "years": 5 },
    { "name": "PHP", "rating": 2, "years": 3 },

    { "name": "Aurelia", "rating": 4, "years": 1 },
    { "name": "Preact */* React */* Redux", "rating": 3, "years": 1 },
    { "name": "Vue.js", "rating": 1, "years": 1 },

    { "name": "Apollo */* GraphQL", "rating": 3, "years": 1 },
    { "name": "Webpack */* Babel", "rating": 4, "years": 2 },
    { "name": "Typescript */* Flow", "rating": 1, "years": 1 },

    { "name": "Hapi.js */* Express.js */* Node.js", "rating": 3, "years": 2 },
    { "name": "Bookshelf.js */* Knex.js", "rating": 3, "years": 2 },
    { "name": "MySQL */* SQLite3", "rating": 2, "years": 5 },

    { "name": "Git */* Git Flow", "rating": 3, "years": 2 },
    { "name": "Agile */* Scrum", "rating": 2, "years": 2 },
    { "name": "JIRA", "rating": 2, "years": 1 },

    { "name": "Photoshop */* Illustrator", "rating": 5, "years": 15 },
    { "name": "Atom */* GitKraken", "rating": 3, "years": 2 },
    { "name": "Ubuntu Linux", "rating": 2, "years": 5 }
  ],

  "jobs": [{
    "company": "4-Tell",
    "title": "UI/UX Developer",
    "start": "October 2016",
    "end": "December 2016",
    "location": "Portland, OR",
    "industry": "eCommerce SaaS",
    "tags": ["Aurelia", "Redux", "Apollo", "GraphQL", "Sass", "JavaScript", "Highcharts", "Webpack", "Microsoft Azure"],
    "summary": "While I was with 4-Tell, I was able to greatly expand my engineering knowledge outside of my usual comfort zone. As the sole developer on their Insights project (a dashboard exposing retail performance data to customers), I was exposed to all aspects of architecting a new product. Working from design comps, I assembled prototypes using mock data while also contributing to the backend API by researching the viability of integrating Node.js into an existing C# .Net microservices stack within Microsoft Azure.",
    "highlights": [
      "Independently architected a single-page application stack using ^[Aurelia](http://aurelia.io/), Redux, and Webpack to build a next-generation online retail analytics product.",
      "Implemented a continuous integration pipeline using ^[Buddy.works](https://buddy.works/) to deploy to a Microsoft Azure web app.",
      "Wrote detailed project documentation designed to quickly bring new developers up to speed with the project architecture, coding standards, and conventions necessary for working on an enterprise scale Aurelia project.",
      "Translated provided UI mock-ups into working interfaces including: Login, Site Selection, Dashboard Navigation, Site Analytics Summary and Details pages, as well as router configuration.",
      "Collaborated with CTO and back-end engineers to develop a modern API specification utilizing GraphQL and a JSON Web Token based authentication strategy."
    ],
    "assignments": []
  }, {
    "company": "Catalyst DevWorks",
    "title": "Developer III",
    "start": "August 2015",
    "end": "February 2016",
    "location": "Beaverton, OR",
    "industry": "Software Engineering Services",
    "tags": ["Html5", "JavaScript", "CSS/Sass", "Aurelia", "Git", "JIRA"],
    "summary": "Catalyst sources talented individuals and trains them as teams of engineers which are contracted out to clients to develop applications on-site and remotely. As a Developer III and an outside hire, my role within the company was to serve as a Technical Lead specializing in Front-End technology for one of these teams. This included mentoring teammates in new technologies and best practices, collaborating with designers to implement component based user interfaces, and evaluating new JavaScript frameworks.",
    "highlights": [],
    "assignments": [
      {
        "name": "Cambia Health Solutions",
        "description": "Regence Insurance Mobile Optimization Project",
        "summary": "",
        "start": "August 2015",
        "end": "January 2016",
        "tags": ["Apache Velocity", "Liferay", "Sass", "Flexbox", "JavaScript", "Java", "Grunt", "Git"],
        "highlights": [
          "Responsible for front-end development of password recovery, message center, and member dashboard UI components for ^[Regence Blue Cross](https://www.regence.com/web/regence_individual/) and ^[Asuris Health](https://www.asuris.com/) in HTML5, CSS Flexbox and JavaScript.",
          "Trained fellow developers in the use of CSS Flexbox, resulting in faster development, cleaner, more maintainable markup, and a significantly more responsive mobile experience.",
          "Audited the front-end build process and implemented more efficient use of Node modules, Grunt and SASS. This resulted in a reduction of duplicate packages down from roughly 2.6 million files (6+ Gb) to under 30 thousand (250 Mb) dramatically improving build times and enabling faster iteration."
        ]
      }, {
        "name": "Catalyst DevWorks",
        "description": "Talent Management Application Project",
        "summary": "",
        "start": "January 2016",
        "end": "February 2016",
        "tags": ["Aurelia", "Bootstrap", "Sass", "ES6", "Webpack", "Swagger", "Express", "Docker", "Gitlab"],
        "highlights": [
          "Lead front-end development of the project, creating wire-frames and engineering the application's structure using the Aurelia JavaScript framework.",
          "Mentored a team of five junior developers in component based architectures, user interface design, CSS Flexbox, and ES6 JavaScript best practices.",
          "Wrote supporting documentation for developer on-boarding, facilitating quick ramp-up times in an environment where developers are frequently rolled on and off projects."
        ]
      }
    ]
  }, {
    "company": "Sellpoints",
    "title": "Front-End Web Developer",
    "start": "December 2014",
    "end": "May 2015",
    "location": "Emeryville, CA",
    "industry": "Online Marketing & Advertising",
    "tags": ["HTML", "CSS", "JavaScript", "jQuery", "AJAX", "Bugzilla", "Dreamweaver", "Illustrator"],
    "summary": "Initially a temp position, Sellpoints quickly hired me on a 6-month contract after proving to be a huge asset to the company. As the go-to developer on the production team, I became responsible for creating proof-of-concepts and served as a consultant on many high-risk, tight-deadline projects.",
    "highlights": [
      "Programmed a browser extension using jQuery and AJAX to automate common tasks for the production team, resulting in hundreds of work hours saved and drastically reduced error rates.",
      "Coded a prototype front-end for an IBM Watson powered search results page shown at CES 2015 within a short 1-week deadline which helped to secure a [$7.5 million Series C investment](https://www-03.ibm.com/press/us/en/pressrelease/46950.wss).",
      "Authored a vector-based icon font and CSS system to modernize an aging set of frequently used icons, enabling more customization, site-specific theming, better mobile support and faster page load times.",
      "Trained over a dozen members of the sales and account management teams how to use an internally developed toolset, enabling the fulfillment of a massive contract for Walmart while at the same time conducting usability testing of the new production platform all while under an incredibly tight deadline."
    ],
    "assignments": []
  }, {
    "company": "Blizzard Entertainment",
    "title": "Level Design Intern",
    "start": "June 2012",
    "end": "September 2012",
    "location": "Irvine, CA",
    "industry": "Computer Video Games",
    "tags": ["StarCraft 2 Galaxy Editor", "Tortoise SVN"],
    "summary": "After years of creating custom maps and helping to grow the mod community for StarCraft 2, Blizzard gave me the opportunity to take my work to the next level. Chosen as one of 40+ interns from a pool of nearly 10k applicants, I was a Multiplayer Level Design Intern for the StarCraft 2 team on Heart of the Swarm. My experience at Blizzard was transformative and gave me invaluable insight into the world of software and video game development.",
    "highlights": [
      "Designed ^[three](http://wiki.teamliquid.net/starcraft2/Atlas_Station) ^[multiplayer](http://wiki.teamliquid.net/starcraft2/Sky_Harvester) ^[maps](http://wiki.teamliquid.net/starcraft2/Vault_of_Secrets) which shipped with Heart of the Swarm. Each was part of the official ladder where they were played millions of times, earned high ratings and praise for fostering innovative play.",
      "Pitched and contributed to the development of the ‘Data Navigator’ visualization tool, which assists developers and fans in understanding the complex structure of game assets, speeding their creation.",
      "Helped develop new community engagement strategies. As a result developers now communicate directly with mod developers, helping to both educate the community and resolve tools related bugs faster."
    ],
    "assignments": []
  }],

  "projects": [{
    "name": "Saeris.io",
    "description": "Personal Website",
    "links": [
      { "title": "Website", "url": "http://www.saeris.io/" },
      { "title": "GitHub Repository", "url": "https://github.com/Saeris/Saeris.io/" }
    ],
    "tags": ["Aurelia", "Redux", "Sass", "ES6", "Snap.svg", "Webpack", "Netlify"],
    "start": "December 2016",
    "end": "Present",
    "summary": "When it comes to my personal websites, I prefer not to use off-the-shelf solutions and instead use them as opportunities to learn new technology. For this iteration, I decided to create a static site generator using the Aurelia JavaScript framework, Redux for application state management, Webpack for bundling and Netlify for hosting.",
    "highlights": [
      "Features a modular Redux architecture that allows for Reducers to be added dynamically, reducing core application bundle size when using route-based chunking.",
      "Media breakpoints are handled with Sass mixins, cutting down on repeated CSS rule definitions and simplifying conditional styling for different screen sizes."
    ]
  }, {
    "name": "Compendium",
    "description": "Magic: The Gathering Collection Management Application",
    "links": [
      { "title": "Website", "url": "http://mtgcompendium.com/" },
      { "title": "GitHub Repository", "url": "https://github.com/Saeris/Compendium" }
    ],
    "tags": ["Aurelia", "Sass", "ES6", "Async/Await", "Snap.svg", "Webpack", "Netlify"],
    "start": "October 2016",
    "end": "Present",
    "summary": "Currently a prototype, this project started as a way to gain more experience with Front-End JavaScript frameworks and has since become an effort to create a production quality example of a modern GraphQL powered progressive web app. It is being developed as an open-source project to serve as a learning resource.",
    "highlights": [
      "Prototype application features a custom-made caching REST API micro-service for fetching card data using async/await.",
      "Utilizes Regular Expressions to parse rules text and apply formatting, convert mana and set symbol codes into CSS icons, and build out lists of keywords for categorization."
    ]
  }, {
    "name": "Scribe",
    "description": "Magic: The Gathering GraphQL API Server",
    "links": [
      { "title": "GitHub Repository", "url": "https://github.com/Saeris/Scribe" }
    ],
    "tags": ["Hapi.js", "Apollo", "GraphQL", "Dataloader", "Bookshelf.js", "Knex.js", "MySQL", "Redis", "JSON Web Tokens", "ES6", "Node.js"],
    "start": "November 2016",
    "end": "Present",
    "summary": "While developing Compendium it quickly became clear that a dedicated production back-end was needed instead of relying on third-party API services. Scribe is a fully-featured GraphQL server with powerful query filtering, pagination, and mutations. It is also published as an open-source project with the goal of providing a real-world example of a Node.js GraphQL server.",
    "highlights": [
      "Includes powerful NPM scripts for quickly setting up a local development environment, including database creation, schema migration, automatic population of data from public APIs, and local caching of images.",
      "Database population script is capable of processing data for over 16,000 cards in under 3 hours, with detailed development logging and performance monitoring to quickly zero-in on errors and bottlenecks.",
      "Server features automatic caching using Dataloader and Redis to optimize database performance while handling nested queries and GraphQL based authentication using JSON Web Tokens."
    ]
  }, {
    "name": "StarCraft II Melee Data Collection Library",
    "description": "Gameplay Statistics Website",
    "links": [
      { "title": "Website", "url": "http://www.miritica.net/apps/MDCL/index.php" },
      { "title": "GitHub Repository", "url": "https://github.com/Saeris/SC2MDCL" }
    ],
    "tags": ["HTML", "CSS", "PHP", "MySQL", "PDO", "jQuery", "Google Chart Tools"],
    "start": "September 2012",
    "end": "March 2013",
    "summary": "After an internship as a Level Designer at Blizzard Entertainment on ^[Heart of the Swarm](http://www.mobygames.com/developer/sheet/view/developerId,576114/) in 2012 I decided to flesh out an idea for gathering gameplay statistics for StarCraft II. This resulted in a website built with PHP which shows detailed information about how in-game units are used, featuring heatmaps and graphs created in JavaScript.",
    "highlights": [
      "Created a library using the in-game scripting system to export over 100 individual data points collected from gameplay event data outputted in XML format. After which a PHP script can be used to add the collected data to a MySQL database.",
      "Engineered a prototype Front-End to display the collected data in various useful ways, such as with heatmaps generated in JavaScript and charts/graphs using Google Chart Tools."
    ]
  }],

  "schools": [{
    "name": "Las Positas College",
    "location": "Livermore, CA",
    "status": "Graduated May 2010",
    "focus": "AA – Visual Communications, Emphasis in Print + Web Design"
  }]
}
